# Jupyter 사용 방법

* h : Help
- a, b : 셀 추가
* m, y : 마크업(제목) 또는 코드
* dd : 셀 한 칸 삭제
* 컨트롤 + 엔터 : 실행

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("../0.ML/1.pandas/data/1.pandas.csv")
print(df)

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [4]:
print("==== 시리즈 ====")
# Series : 1차원 배열
# [] Series 형식으로 가져온다
print(df["name"])
print(df.age)

print("==== 데이터 프레임 ====")
# [[]] DataFrame 형식으로 가져온다
# 여러 개의 값을 가져오고자 하는 경우[[]]
print(df[["name", "age"]])

print("==== 인덱싱 ====")
# 인덱싱 : 인덱스의 범위를 지정한다.
print(df[ 1:3 ])
print(df[ :3 ])
print(df[ 1: ])

print("==== LOC ====")
# LOC : DF.loc[ index조건식, 컬럼 조건식 ]
print(df.loc[ 1:3, "name" ])
print(df.loc[ 1:3, ["name", "score"] ])
print(df.loc[ :, "name":"grade" ])
print(df.loc[ 1:3,  ])
print("=============")
print(df["grade"] == 'A')
print(df[ df["grade"] == "A" ])

==== 시리즈 ====
0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object
0    20
1    30
2    40
3    50
Name: age, dtype: int64
==== 데이터 프레임 ====
   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50
==== 인덱싱 ====
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50
==== LOC ====
1     Cho
2    Choi
3      jo
Name: name, dtype: object
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
   name  score grade
0   Kim  100.0     A
1   Cho   95.0     A
2  Choi   90.5     B
3    jo   85.7     B
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50
=============
0     True
1     True
2    False
3    False
Name: grade, dtype: bool
  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

### DataFrame 삭제
* 인덱스를 기준으로 행 삭제

In [5]:
df.drop(2)

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [6]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [7]:
df = df.drop(3)
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40

In [8]:
df.drop(1, inplace = True)
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40

### axis
* 열 또는 행 중에 어떠한 값을 기준으로 설정할지 결정
* axis는 기본적으로 행(index)로 설정되면 axis = 0
* axis = 0 : index 삭제
* axis = 1 : 컬럼, 열 삭제

In [9]:
df.drop(0, axis=0, inplace = True)
df

   name  score grade  age
2  Choi   90.5     B   40

In [10]:
df.drop("score", axis=1, inplace = True)
df

   name grade  age
2  Choi     B   40

### Boolean 처리
* 특정 데이터 연산하면 결과는 True, False
* DataFrame에 True 값을 전달하면 해당 위치에 값들을 얻어온다.

In [11]:
df = pd.read_csv("../0.ML/1.pandas/data/1.pandas.csv")
print(df)

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [14]:
df[ df["score"] < 95 ][["name"]]

   name
2  Choi
3    jo

In [15]:
df.loc[ df["score"] < 95, "name" ]

2    Choi
3      jo
Name: name, dtype: object

In [16]:
df.loc[ df["score"] < 95 ][["name", "score"]]

   name  score
2  Choi   90.5
3    jo   85.7

In [17]:
df.loc[ df["score"] < 95, ["name", "score"]]

   name  score
2  Choi   90.5
3    jo   85.7

In [18]:
df.loc[ df["score"] < 95, : ]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [19]:
df[ df["score"] < 95].loc[ : , "name":"grade"]

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

### DataFrame 명령어

In [21]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

In [22]:
df.values

array([['Kim', 100.0, 'A', 20],
       ['Cho', 95.0, 'A', 30],
       ['Choi', 90.5, 'B', 40],
       ['jo', 85.7, 'B', 50]], dtype=object)

* dtypes
    - 자료형을 알려준다
    - object : 문자열
    - float : 실수
    - int : 정수

In [23]:
df.dtypes

name      object
score    float64
grade     object
age        int64
dtype: object

In [24]:
df["grade"].isin([ "A" ])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [25]:
df[ df["grade"].isin(["A"]) ]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [26]:
df.loc[ df["grade"].isin(["A"]), ["name", "grade"] ]

  name grade
0  Kim     A
1  Cho     A

In [27]:
index_name = ["김씨1", "김씨2", "김씨3", "김씨4"]
df.index = index_name
df

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40
김씨4    jo   85.7     B   50

In [31]:
df[ "김씨1":"김씨3" ]

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40

In [30]:
df[ 1:3 ]

     name  score grade  age
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40